{
  "backend/main.mo": "Motoko actor defining data types (Subject, Note, Flashcard, Exam, StudySession, DayProgress) and public functions for managing daily timetables, notes, flashcards, and exam countdowns with in-memory storage using Lists and Maps.",
  "feature_evidence.json": "Feature evidence report mapping six main features (daily planner, Pomodoro timer, notes, flashcards, exam countdown, AI assistant) to their implementing files, components, and test IDs with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend files including pages, components, hooks, and configuration files for the Smart Study Buddy application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space for backgrounds, foregrounds, borders, and component variants.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Smart Study Buddy application.",
  "frontend/src/App.tsx": "TanStack Router setup defining six routes (dashboard, planner, timer, notes, flashcards, AI assistant) wrapped in a Layout component with type-safe router configuration.",
  "frontend/src/components/ExamCard.tsx": "Card component displaying exam name, date, and countdown with color-coded badges indicating urgency status (today, urgent, upcoming, or completed).",
  "frontend/src/components/FlashcardList.tsx": "Grid layout component rendering flashcard previews with question text and truncated answer hints in hoverable cards.",
  "frontend/src/components/FlashcardReview.tsx": "Full-screen flashcard review interface with flip animation, navigation controls, progress bar, and card counter for studying flashcard decks.",
  "frontend/src/components/Layout.tsx": "Main layout component with responsive navigation header, mobile menu sheet, and footer; includes navigation links for Dashboard, Planner, Timer, Notes, Flashcards, and AI Helper pages.",
  "frontend/src/components/NoteCard.tsx": "Displays a single note in a card format with subject badge and truncated content preview.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAIChat.ts": "Custom hook providing AI chat functionality with hardcoded responses for study topics like photosynthesis, quadratic equations, World War 2, and study tips; simulates typing delay for assistant messages.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using @dfinity/auth-client with delegation identity management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on subjects, notes, flashcards, and exams, using the backend actor and localStorage as fallback for some data retrieval.",
  "frontend/src/hooks/useStudyProgress.ts": "Tracks daily study progress in minutes, calculates study streaks, and persists data to localStorage with automatic daily reset.",
  "frontend/src/hooks/useTimer.ts": "Implements Pomodoro timer with 25-minute focus sessions and 5-minute breaks, tracking session count and updating study progress upon completion.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a soft, calming color palette for light and dark themes, including primary teal, secondary peach, and various UI element colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/AIAssistant.tsx": "AI chat interface page with message display, typing indicators, and input field for students to ask study-related questions to an AI assistant.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard displaying study statistics (streak, daily hours, progress), upcoming exams, and quick action buttons with a mascot hero section.",
  "frontend/src/pages/FlashcardsMode.tsx": "Flashcard management page with dialog for creating new cards, review mode toggle, and list display of existing flashcards for quick revision.",
  "frontend/src/pages/NotesSection.tsx": "Notes management page with search functionality, dialog for creating new notes, and grouped display of notes organized by subject.",
  "frontend/src/pages/PomodoroTimer.tsx": "Pomodoro timer page with 25-minute focus sessions, 5-minute breaks, play/pause/reset controls, progress bar, and productivity tips.",
  "frontend/src/pages/StudyPlanner.tsx": "React component for the Study Planner page that allows users to add/remove subjects with study times, add exams with dates, and displays a daily timetable with total study time calculation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system, typography, container queries, animations, custom font sizes, shadows, and border radius variables.",
  "project_state.json": "Project metadata file documenting the Smart Study Buddy app for Class 8-12 students, listing seven implemented features including daily planner, Pomodoro timer, notes, flashcards, exam countdown, AI assistant, and progress tracking."
}